# -*- coding: utf-8 -*-
"""Центральное селение.

Имеется k селений. Если в селении i расположить пункт скорой помощи, то оездка по вызову в селение j займет время:

A[i,j] + A[i, j], (1<=i, j<=k, i<>j).

Найти номер селения i, от которого поездка в самое удаленное (по времени) селение занимала бы минимальное время.
Массив A[1:k, 1:k] задан. В нем все A[i,j]>0 и элемент A[i,j] может бытьь не равен элементу A[j,i]."""

# a = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
a = [[10, 277, 3], [4976, 5, 64], [756457, 8, 9]]

print a

k = 3

i = 0
j = 0
s_max = 0
i_min = 0
s_min = 0

while i < k:
    j = 0

    while j < k:
        if j != i and s_max < a[i][j]:
            s_max = a[i][j]
        j = j + 1

    i = i + 1

print s_max

i = 0
while i < k:
    if s_min == 0:
        s_min = s_max + a[i][i]
        i_min = i

    if a[i][i] + s_max < s_min:
        s_min = s_max + a[i][i]
        i_min = i

    i = i + 1

print 'Result:'
print i_min
