# -*- coding: utf-8 -*-
"""Перестановка 0, 1, 2. В массиве X[1:n] каждый элемент равен 0, 1 или 2. Переставить элементы массива так,
чтобы сначала располагались все нули, затем все еденицы и, наконец, все двойки(дополнительного массива не заводить)."""

a = [0, 1, 1, 1, 1, 0, 0, 0, 2, 0, 0, 1, 0]  # 0 -> 7, 1 -> 5, 2 -> 1

a_0 = 0
a_1 = 0
a_2 = 0

print(a)

for i in range(len(a)):
    if a[i] == 0:
        a_0 = a_0 + 1
    elif a[i] == 1:
        a_1 = a_1 + 1
    else:
        a_2 = a_2 + 1

print("a_0 = " + str(a_0))
print("a_1 = " + str(a_1))
print("a_2 = " + str(a_2))

for i in range(len(a)):
    if i < a_0:
        a[i] = 0
    elif a_0 + a_1 > i >= a_0:
        a[i] = 1
    else:
        a[i] = 2

print(a)
